name: "postprocess"
backend: "python"
max_batch_size: 0
input [{ name: "output0" data_type: TYPE_FP32 dims: [84,-1] }]
output [{ name: "FINAL_OUTPUT" data_type: TYPE_STRING dims: [1] }]
instance_group [{ kind: KIND_CPU }]