name: "ensemble_yolo"
platform: "ensemble"
max_batch_size: 0
input [{ name: "RAW_INPUT" data_type: TYPE_STRING dims: [1] }]
output [{ name: "FINAL_OUTPUT" data_type: TYPE_STRING dims: [1] }]
ensemble_scheduling {
 step [
  {
   model_name: "preprocess"
   model_version: -1
   input_map { key: "RAW_INPUT" value: "RAW_INPUT" }
   output_map { key: "images" value: "images_tensor" }
  },
  {
   model_name: "yolo_ensemble"
   model_version: -1
   input_map { key: "images" value: "images_tensor" }
   output_map { key: "output0" value: "raw_out" }
  },
  {
   model_name: "postprocess"
   model_version: -1
   input_map { key: "output0" value: "raw_out" }
   output_map { key: "FINAL_OUTPUT" value: "FINAL_OUTPUT" }
  }
 ]
}
